<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest RCDefaultApp disk image.</string>
	<key>Identifier</key>
	<string>com.github.triti.download.RCDefaultApp</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RCDefaultApp</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(Downloads/RCDefaultApp\-[\d\.X]+\.dmg)</string>
				<key>result_output_var_name</key>
				<string>urlpath</string>
				<key>url</key>
				<string>https://www.rubicode.com/Software/RCDefaultApp/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.rubicode.com/%urlpath%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
