<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Finds the latest Office 2011 update, downloads the disk image, extracts the pkg, 
and disables the component that quits any running apps using a modified preinstall script.</string>
	<key>Identifier</key>
	<string>com.github.triti.pkg.Office2011UpdatesNoQuit</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Office2011Update-NoQuit</string>
		<key>VERSION</key>
		<string>latest</string>
		<key>CULTURE_CODE</key>
		<string>0409</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.Office2011Updates</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The triti-recipes repository is deprecated and will be archived soon (details: https://github.com/autopkg/triti-recipes/issues/12).</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Office2011_all_quit_*.combo.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_DIR%/Scripts/preinstall</string>
				<key>destination_path</key>
				<string>%found_filename%/Scripts/preinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FlatPkgPacker</string>
			<key>Arguments</key>
			<dict>
				<key>source_flatpkg_dir</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>destination_pkg</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
