<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the ESET Remote Administrator Agent.</string>
	<key>Identifier</key>
	<string>com.github.triti.download.EraAgent6</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EraAgent</string>
		<key>ERAA_INSTALLER_URL</key>
		<string>https://download.eset.com/download/ra/v6/standalone-installers/agent/Agent-MacOSX-i386.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%ERAA_INSTALLER_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
