<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Google Chrome, builds a package, and copies it to 
the DeployStudio packages repository.
Input keys:
- DS_PKGS_PATH is the path for the Packages folder in the DeployStudio 
  repository (trailing slash not required/desired).
  The path does not need to be on the same volume as the cache, as the pkg is 
  being duplicated.
- DS_NAME is what the final package will be called in DeployStudio, regardless 
  of what was generated by the parent recipe.
  It defaults to %NAME% (just the app name); use %pkgname% if you want the 
  version number appended.
</string>
    <key>Identifier</key>
    <string>com.github.triti.ds.googlechrome</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
        <string>/Volumes/DeployStudio/Packages</string>
        <key>DS_NAME</key>
        <string>%NAME%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.googlechrome</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The triti-recipes repository is deprecated and will be archived soon (details: https://github.com/autopkg/triti-recipes/issues/12).</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>new_package_request == FALSE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pkg_path%</string>
                <key>pkg_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
