<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest f.lux application and builds a package. This recipe differs from others by pulling the bundle id from the app instead of hardcoding it in a variable.</string>
	<key>Identifier</key>
	<string>com.github.triti.pkg.Flux</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Flux</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jaharmi.download.Flux</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The triti-recipes repository is deprecated and will be archived soon (details: https://github.com/autopkg/triti-recipes/issues/12).</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
